define 【Kira】 = Character("【Kira】")
define 【博良】 = Character("【博良】")
define 【雨声】 = Character("【雨声】")
define 【安德森】 = Character("【安德森】")
define 【墨非白】 = Character("【墨非白】")
image 【Kira】_resized = im.Scale("【Kira】.png", 500,800)
image 【博良】_resized = im.Scale("【博良】.png", 500,800)
image 【雨声】_resized = im.Scale("【雨声】.png", 500,800)
image 【安德森】_resized = im.Scale("【安德森】.png", 500,800)
image 【墨非白】_resized = im.Scale("【墨非白】.png", 500,800)

label start:

    scene bg room

    show 【Kira】_resized at left
    voice "../voice/【Kira】/001【Kira】 反正这次依旧是在大家熟悉的竞技场里.mp3"
    【Kira】 "反正这次依旧是在大家熟悉的竞技场里"
    voice "../voice/【Kira】/002【Kira】 竞技场大门打开之后，左侧出现的是伟瑞彼格·疯鹅.mp3"
    【Kira】 "竞技场大门打开之后，左侧出现的是伟瑞彼格·疯鹅"
    voice "../voice/【Kira】/003【Kira】 伟瑞彼格·疯鹅是一位敏捷的胖子，他有着哥斯拉改造人强化技能组！必杀技！放射热线！！！.mp3"
    【Kira】 "伟瑞彼格·疯鹅是一位敏捷的胖子，他有着哥斯拉改造人强化技能组！必杀技！放射热线！！！"
    voice "../voice/【Kira】/004【Kira】 此刻入场的这人穿着简朴且肮脏的水手服，似乎是穿了很久的缘故，上面有很多破洞和碎布打成的补丁。他肥胖的脸上挂着坨坨横肉，黄褐色的皮肤下面似乎因为很久未洗澡的缘故看上去脏兮兮的。由于赘肉的缘故他的眼睛被挤得很小，总是给人一副眯着个眼睛不知道目光究竟打量着哪里的感觉。.mp3"
    【Kira】 "此刻入场的这人穿着简朴且肮脏的水手服，似乎是穿了很久的缘故，上面有很多破洞和碎布打成的补丁。他肥胖的脸上挂着坨坨横肉，黄褐色的皮肤下面似乎因为很久未洗澡的缘故看上去脏兮兮的。由于赘肉的缘故他的眼睛被挤得很小，总是给人一副眯着个眼睛不知道目光究竟打量着哪里的感觉。"
    voice "../voice/【Kira】/005【Kira】 而竞技场右侧大门中于低迷的暗处走出的是！.mp3"
    【Kira】 "而竞技场右侧大门中于低迷的暗处走出的是！"
    voice "../voice/【Kira】/006【Kira】 精神小伙同仁堂！.mp3"
    【Kira】 "精神小伙同仁堂！"
    voice "../voice/【Kira】/007【Kira】 精神小伙同仁堂穿着一身从视觉上讲让人感到不搭调的黑衣，他的背影看起来总是给人一种孤僻的印象。同仁堂的面容冷淡，五官看起来仿佛像少女一样纤细，皮肤白皙但却是个实实在在的男生。.mp3"
    【Kira】 "精神小伙同仁堂穿着一身从视觉上讲让人感到不搭调的黑衣，他的背影看起来总是给人一种孤僻的印象。同仁堂的面容冷淡，五官看起来仿佛像少女一样纤细，皮肤白皙但却是个实实在在的男生。"
    voice "../voice/【Kira】/008【Kira】 同仁堂是一位极端的反应系角色，他的反应力足足达到了A级。而疯鹅则是把自己的爆发力强化到了机制，成为了当之无愧的中枢洪金宝！.mp3"
    【Kira】 "同仁堂是一位极端的反应系角色，他的反应力足足达到了A级。而疯鹅则是把自己的爆发力强化到了机制，成为了当之无愧的中枢洪金宝！"
    voice "../voice/【Kira】/009【Kira】 让我们来看看二位选手的技能和装备，首先展示的是疯鹅这边.mp3"
    【Kira】 "让我们来看看二位选手的技能和装备，首先展示的是疯鹅这边"
    voice "../voice/【Kira】/010【Kira】 头冠和基因解放带来了不俗的护甲，自我康复更是增加了这个胖子的续航能力，决胜的机会就在于能否通过热线一击必杀敌人！.mp3"
    【Kira】 "头冠和基因解放带来了不俗的护甲，自我康复更是增加了这个胖子的续航能力，决胜的机会就在于能否通过热线一击必杀敌人！"
    voice "../voice/【Kira】/011【Kira】 当然即便打不中，这位胖子也有后手，他可以开启超怪力，利用强悍的爆发力与敌人发生肉搏！.mp3"
    【Kira】 "当然即便打不中，这位胖子也有后手，他可以开启超怪力，利用强悍的爆发力与敌人发生肉搏！"
    voice "../voice/【Kira】/012【Kira】 同仁堂这边则是麻雀虽小五脏俱全.mp3"
    【Kira】 "同仁堂这边则是麻雀虽小五脏俱全"
